[
    {
        "name": "Kettlebell Alternating Hang Clean",
        "description": "This exercise involves using a kettlebell to perform alternating hang cleans, which involves lifting the kettlebell from a hanging position and bringing it up to the shoulder in a fluid motion. This exercise targets the shoulders, back, and core muscles.",
        "muscles": "Biceps,Forearms,Upper Arms",
        "image": "kettlebell_exercises/Kettlebell_Alternating_Hang_Clean.jpg"
    },
    {
        "name": "Kettlebell Alternating Press",
        "description": "This exercise involves holding a kettlebell in each hand and pressing them alternately overhead while standing. It targets the shoulders, triceps, and core muscles.",
        "muscles": "Front Deltoid,Shoulders",
        "image": "kettlebell_exercises/Kettlebell_Alternating_Press.jpg"
    },
    {
        "name": "Kettlebell Alternating Renegade Row",
        "description": "This exercise involves using a kettlebell to perform alternating rows while in a plank position. It targets the back, shoulders, and core muscles.",
        "muscles": "Back,Latissimus Dorsi,Traps",
        "image": "kettlebell_exercises/Kettlebell_Alternating_Renegade_Row.jpg"
    },
    {
        "name": "Kettlebell Alternating Row",
        "description": "This exercise involves holding a kettlebell in one hand and rowing it up towards the chest while keeping the other arm extended. The movement is then repeated on the other side, alternating between left and right. This exercise targets the back muscles, particularly the lats and rhomboids.",
        "muscles": "Abs,Back,Latissimus Dorsi,Traps",
        "image": "kettlebell_exercises/Kettlebell_Alternating_Row.jpg"
    },
    {
        "name": "Kettlebell Angled Press",
        "description": "This exercise involves holding a kettlebell in one hand and pressing it upwards at an angle, while keeping the other arm extended for balance. It primarily targets the shoulders and triceps, while also engaging the core and legs for stability.",
        "muscles": "Back,Front Deltoid,Traps",
        "image": "kettlebell_exercises/Kettlebell_Angled_Press.jpg"
    },
    {
        "name": "Kettlebell Arnold Press",
        "description": "This exercise involves holding a kettlebell in each hand and performing a shoulder press while rotating the weights inward and outward, similar to the motion of an Arnold Schwarzenegger bicep curl. It targets the shoulders, triceps, and upper back muscles.",
        "muscles": "Front Deltoid,Shoulders",
        "image": "kettlebell_exercises/Kettlebell_Arnold_Press.jpg"
    },
    {
        "name": "Kettlebell Backward Lunge",
        "description": "This exercise involves holding a kettlebell and stepping backwards into a lunge position, then returning to a standing position. It targets the legs, glutes, and core muscles.",
        "muscles": "Glutes,Hips,Quadriceps,Thighs",
        "image": "kettlebell_exercises/Kettlebell_Backward_Lunge.jpg"
    },
    {
        "name": "Kettlebell Bent Over Row",
        "description": "This exercise involves using a kettlebell to perform a bent-over row, which targets the muscles in the back, shoulders, and arms. The movement involves bending forward at the hips while holding the kettlebell with both hands, then pulling the weight up towards the chest while keeping the elbows close to the body.",
        "muscles": "Back",
        "image": "kettlebell_exercises/Kettlebell_Bent_Over_Row.jpg"
    },
    {
        "name": "Kettlebell Bent Press",
        "description": "This exercise involves holding a kettlebell in one hand and pressing it overhead while simultaneously bending to the opposite side. It targets the shoulders, core, and obliques.",
        "muscles": "Front Deltoid,Obliques,Waist",
        "image": "kettlebell_exercises/Kettlebell_Bent_Press.jpg"
    },
    {
        "name": "Kettlebell Biceps Curl",
        "description": "This exercise involves holding a kettlebell in each hand and curling them up towards your shoulders, targeting the biceps muscles. It is a great way to build strength and definition in the arms.",
        "muscles": "Biceps,Upper Arms",
        "image": "kettlebell_exercises/Kettlebell_Biceps_Curl.jpg"
    },
    {
        "name": "Kettlebell Bottoms Up Clean From the Hang Position",
        "description": "This exercise involves using a kettlebell and starting in a hang position. The kettlebell is then cleaned up to a bottoms up position, where the handle is pointing towards the ceiling. This exercise helps to improve grip strength, shoulder stability, and overall body control.",
        "muscles": "Forearms,Upper Arms",
        "image": "kettlebell_exercises/Kettlebell_Bottoms_Up_Clean_From_the_Hang_Position.jpg"
    },
    {
        "name": "Kettlebell Box Squat",
        "description": "This exercise involves holding a kettlebell in front of your chest while performing a squat with your feet on a box or bench. It targets the lower body muscles, including the glutes, quads, and hamstrings, while also engaging the core and upper body.",
        "muscles": "Glutes,Hips,Quadriceps",
        "image": "kettlebell_exercises/Kettlebell_Box_Squat.jpg"
    },
    {
        "name": "Kettlebell Clean and Jerk",
        "description": "This exercise involves lifting a kettlebell from the ground to the shoulder, then pushing it overhead in a single fluid motion. It is a full-body exercise that targets the shoulders, back, legs, and core.",
        "muscles": "Weightlifting",
        "image": "kettlebell_exercises/Kettlebell_Clean_and_Jerk.jpg"
    },
    {
        "name": "Kettlebell Clean and Press",
        "description": "This exercise involves lifting a kettlebell from the ground to the shoulder, then pressing it overhead. It is a full-body movement that targets the shoulders, back, legs, and core. It can be done with one or two kettlebells.",
        "muscles": "Weightlifting",
        "image": "kettlebell_exercises/Kettlebell_Clean_and_Press.jpg"
    },
    {
        "name": "Kettlebell Concentration Curl",
        "description": "This exercise involves holding a kettlebell in one hand and curling it towards the shoulder while keeping the upper arm stationary. It primarily targets the biceps and can be done with various weights and repetitions.",
        "muscles": "Upper Arms",
        "image": "kettlebell_exercises/Kettlebell_Concentration_Curl.jpg"
    },
    {
        "name": "Kettlebell Dead Bug",
        "description": "This exercise involves lying on your back with a kettlebell held above your chest, while simultaneously extending your opposite arm and leg away from your body. The goal is to maintain stability and control throughout the movement, engaging your core muscles.",
        "muscles": "Waist",
        "image": "kettlebell_exercises/Kettlebell_Dead_Bug.jpg"
    },
    {
        "name": "Kettlebell Dead Clean",
        "description": "This exercise involves lifting a kettlebell from the ground to the chest in a clean motion, using the hips and legs to generate power. It primarily targets the muscles of the posterior chain, including the glutes, hamstrings, and lower back.",
        "muscles": "Weightlifting",
        "image": "kettlebell_exercises/Kettlebell_Dead_Clean.jpg"
    },
    {
        "name": "Kettlebell Deadlift",
        "description": "This exercise involves lifting a kettlebell from the ground using a deadlift motion, which primarily targets the muscles in the legs and lower back. It is a great exercise for building overall strength and improving posture.",
        "muscles": "Glutes,Hips,Quadriceps,Thighs",
        "image": "kettlebell_exercises/Kettlebell_Deadlift.jpg"
    },
    {
        "name": "Kettlebell Deck Squat",
        "description": "This exercise involves holding a kettlebell at chest level while performing a squat and then returning to a standing position. It targets the lower body muscles, including the glutes, quads, and hamstrings, while also engaging the core and upper body.",
        "muscles": "Back,Hips,Thighs,Waist",
        "image": "kettlebell_exercises/Kettlebell_Deck_Squat.jpg"
    },
    {
        "name": "Kettlebell Double Jerk",
        "description": "This exercise involves holding a kettlebell in each hand and performing a double jerk movement, which involves bending the knees and explosively pushing the kettlebells overhead while simultaneously dropping into a partial squat. The movement is then reversed to return to the starting position. This exercise targets the shoulders, triceps, and legs.",
        "muscles": "Shoulders",
        "image": "kettlebell_exercises/Kettlebell_Double_Jerk.jpg"
    },
    {
        "name": "Kettlebell Double Snatch",
        "description": "This exercise involves using a kettlebell to perform a double snatch movement, which involves lifting the kettlebell from the ground to overhead in one fluid motion using both arms. It is a full-body exercise that targets the shoulders, back, legs, and core.",
        "muscles": "Upper Arms",
        "image": "kettlebell_exercises/Kettlebell_Double_Snatch.jpg"
    },
    {
        "name": "Kettlebell Double Windmill",
        "description": "This exercise involves holding a kettlebell in one hand and performing a windmill motion with the body, lowering the kettlebell towards the opposite foot. It targets the core, shoulders, and hips while also improving flexibility and stability. The exercise can be challenging and requires proper form to avoid injury.",
        "muscles": "Obliques,Waist",
        "image": "kettlebell_exercises/Kettlebell_Double_Windmill.jpg"
    },
    {
        "name": "Kettlebell Farmers Carry",
        "description": "This exercise involves holding a kettlebell in each hand and walking for a certain distance or time. It primarily targets the grip, core, and leg muscles while also improving overall stability and balance.",
        "muscles": "Glutes,Hips,Quadriceps,Thighs",
        "image": "kettlebell_exercises/Kettlebell_Farmers_Carry.jpg"
    },
    {
        "name": "Kettlebell Figure 8",
        "description": "This exercise involves passing a kettlebell between your legs in a figure 8 motion while standing with your feet shoulder-width apart. It targets the core, glutes, and legs while also improving coordination and balance.",
        "muscles": "Obliques,Waist",
        "image": "kettlebell_exercises/Kettlebell_Figure_8.jpg"
    },
    {
        "name": "Kettlebell Forward Lunge",
        "description": "This exercise involves holding a kettlebell in one hand and stepping forward into a lunge position with the opposite leg. The movement targets the lower body muscles, including the glutes, quads, and hamstrings, while also engaging the core and improving balance and stability.",
        "muscles": "Hips,Thighs",
        "image": "kettlebell_exercises/Kettlebell_Forward_Lunge.jpg"
    },
    {
        "name": "Kettlebell Front Raise",
        "description": "This exercise involves holding a kettlebell in front of your body with both hands and raising it up to shoulder height, then lowering it back down. It primarily targets the shoulders and can be done with various weights and repetitions.",
        "muscles": "Shoulders",
        "image": "kettlebell_exercises/Kettlebell_Front_Raise.jpg"
    },
    {
        "name": "Kettlebell Front Squat",
        "description": "This exercise involves holding a kettlebell in front of your body while performing a squat. It targets the lower body muscles, including the quads, glutes, and hamstrings, as well as the core muscles. It can be modified for different fitness levels by adjusting the weight of the kettlebell.",
        "muscles": "Glutes,Quadriceps,Thighs",
        "image": "kettlebell_exercises/Kettlebell_Front_Squat.jpg"
    },
    {
        "name": "Kettlebell Full Swing",
        "description": "This exercise involves swinging a kettlebell from between the legs up to shoulder height, using a hip hinge movement. It targets the posterior chain muscles, including the glutes, hamstrings, and lower back, as well as the shoulders and core. It can be used for strength and conditioning purposes.",
        "muscles": "Front Deltoid,Glutes,Hips,Shoulders",
        "image": "kettlebell_exercises/Kettlebell_Full_Swing.jpg"
    },
    {
        "name": "Kettlebell Goblet Carry",
        "description": "This exercise involves holding a kettlebell by the handle with both hands and carrying it in front of your chest while walking. It targets the core, shoulders, and upper back muscles while also improving grip strength and stability.",
        "muscles": "Thighs",
        "image": "kettlebell_exercises/Kettlebell_Goblet_Carry.jpg"
    },
    {
        "name": "Kettlebell Goblet Squat",
        "description": "This exercise involves holding a kettlebell close to your chest while performing a squat. It targets the lower body muscles, including the quads, glutes, and hamstrings, while also engaging the core and upper body. It can be modified for different fitness levels by adjusting the weight of the kettlebell.",
        "muscles": "Glutes,Quadriceps,Thighs",
        "image": "kettlebell_exercises/Kettlebell_Goblet_Squat.jpg"
    },
    {
        "name": "Kettlebell Good Morning",
        "description": "This exercise involves holding a kettlebell in front of your chest and bending forward at the hips while keeping your back straight. It primarily targets the hamstrings and glutes.",
        "muscles": "Hamstrings,Hips",
        "image": "kettlebell_exercises/Kettlebell_Good_Morning.jpg"
    },
    {
        "name": "Kettlebell Half Turkish Get-up",
        "description": "This exercise involves using a kettlebell to perform a half Turkish get-up, which involves lying on your back, holding the kettlebell with one hand, and using your core and arm strength to lift yourself up to a seated position. The exercise is great for building core and upper body strength, as well as improving balance and stability.",
        "muscles": "Thighs",
        "image": "kettlebell_exercises/Kettlebell_Half_Turkish_Get-up.jpg"
    },
    {
        "name": "Kettlebell Hang Clean",
        "description": "This exercise involves using a kettlebell to perform a hang clean movement, which involves lifting the kettlebell from a hanging position and bringing it up to the chest while keeping the elbows high. It is a full-body exercise that targets the shoulders, back, legs, and core.",
        "muscles": "Biceps,Calves,Forearms,Front Deltoid,Glutes,Hamstrings,Quadriceps,Shoulders,Side Deltoid",
        "image": "kettlebell_exercises/Kettlebell_Hang_Clean.jpg"
    },
    {
        "name": "Kettlebell Lateral Lunge",
        "description": "This exercise involves holding a kettlebell in one hand and stepping to the side with the opposite leg, bending the knee and lowering the body into a lunge position. The movement targets the glutes, quads, and inner thighs while also engaging the core and improving balance.",
        "muscles": "Thighs",
        "image": "kettlebell_exercises/Kettlebell_Lateral_Lunge.jpg"
    },
    {
        "name": "Kettlebell Lateral Raise",
        "description": "This exercise involves holding a kettlebell in one hand and raising it laterally to shoulder height, while keeping the arm straight. It primarily targets the deltoid muscles in the shoulder and can help improve shoulder stability and mobility.",
        "muscles": "Shoulders,Side Deltoid",
        "image": "kettlebell_exercises/Kettlebell_Lateral_Raise.jpg"
    },
    {
        "name": "Kettlebell Lunge Pass Through",
        "description": "The Kettlebell Lunge Pass Through is an exercise that involves holding a kettlebell in one hand and lunging forward with the opposite leg while passing the kettlebell under the lunging leg and catching it with the other hand. This exercise targets the legs, core, and shoulders while also improving coordination and balance.",
        "muscles": "Glutes,Quadriceps,Thighs",
        "image": "kettlebell_exercises/Kettlebell_Lunge_Pass_Through.jpg"
    },
    {
        "name": "Kettlebell Lunge With Twist",
        "description": "This exercise involves holding a kettlebell in front of your chest while performing lunges, and twisting your torso to the side with each lunge. It targets the legs, core, and obliques.",
        "muscles": "Thighs",
        "image": "kettlebell_exercises/Kettlebell_Lunge_With_Twist.jpg"
    },
    {
        "name": "Kettlebell One Arm Bench Press",
        "description": "This exercise involves using a kettlebell to perform a bench press with one arm at a time. It targets the chest, shoulders, and triceps while also engaging the core for stability.",
        "muscles": "Chest",
        "image": "kettlebell_exercises/Kettlebell_One_Arm_Bench_Press.jpg"
    },
    {
        "name": "Kettlebell One Arm Clean",
        "description": "This exercise involves lifting a kettlebell from the ground to the shoulder in one fluid motion using only one arm. It requires proper technique and core stability to prevent injury and maximize results.",
        "muscles": "Weightlifting",
        "image": "kettlebell_exercises/Kettlebell_One_Arm_Clean.jpg"
    },
    {
        "name": "Kettlebell One Arm Clean and Jerk",
        "description": "This exercise involves lifting a kettlebell with one arm from the ground to the shoulder, then pushing it overhead in a jerking motion. It is a full-body exercise that targets the shoulders, back, legs, and core.",
        "muscles": "Biceps,Calves,Forearms,Front Deltoid,Glutes,Hamstrings,Quadriceps,Shoulders,Side Deltoid,Triceps",
        "image": "kettlebell_exercises/Kettlebell_One_Arm_Clean_and_Jerk.jpg"
    },
    {
        "name": "Kettlebell One Arm Floor Press",
        "description": "This exercise involves lying on the floor with a kettlebell in one hand and pressing it upwards while keeping the other arm extended. It targets the chest, triceps, and shoulders while also engaging the core muscles for stability.",
        "muscles": "Chest",
        "image": "kettlebell_exercises/Kettlebell_One_Arm_Floor_Press.jpg"
    },
    {
        "name": "Kettlebell One Arm Jerk",
        "description": "This exercise involves holding a kettlebell in one hand and performing a quick, explosive movement to lift it overhead. It primarily targets the shoulders, triceps, and core muscles. The movement requires proper technique and coordination to avoid injury and maximize results.",
        "muscles": "Front Deltoid,Glutes,Hamstrings,Quadriceps,Side Deltoid,Thighs,Triceps",
        "image": "kettlebell_exercises/Kettlebell_One_Arm_Jerk.jpg"
    },
    {
        "name": "Kettlebell One Arm Push Press",
        "description": "This exercise involves holding a kettlebell in one hand and performing a push press movement, which involves bending the knees and using the legs to help drive the kettlebell overhead. It primarily targets the shoulders, triceps, and core muscles.",
        "muscles": "Front Deltoid,Shoulders",
        "image": "kettlebell_exercises/Kettlebell_One_Arm_Push_Press.jpg"
    },
    {
        "name": "Kettlebell One Arm Row",
        "description": "This exercise involves using a kettlebell to perform a rowing motion with one arm, targeting the back muscles. The movement involves pulling the kettlebell towards the body while keeping the core engaged and maintaining proper form.",
        "muscles": "Abs,Back,Latissimus Dorsi,Traps",
        "image": "kettlebell_exercises/Kettlebell_One_Arm_Row.jpg"
    },
    {
        "name": "Kettlebell One Arm Snatch",
        "description": "This exercise involves using a kettlebell to perform a one arm snatch movement, which involves lifting the kettlebell from the ground to overhead in one fluid motion. It is a full body exercise that targets the shoulders, back, legs, and core.",
        "muscles": "Calves,Front Deltoid,Glutes,Hamstrings,Quadriceps,Shoulders,Side Deltoid,Triceps",
        "image": "kettlebell_exercises/Kettlebell_One_Arm_Snatch.jpg"
    },
    {
        "name": "Kettlebell One Arm Swing",
        "description": "This exercise involves swinging a kettlebell with one arm, using a hip hinge movement to generate power and momentum. It primarily targets the posterior chain muscles, including the glutes, hamstrings, and lower back, while also engaging the core and shoulders.",
        "muscles": "Front Deltoid,Glutes,Hamstrings,Weightlifting",
        "image": "kettlebell_exercises/Kettlebell_One_Arm_Swing.jpg"
    },
    {
        "name": "Kettlebell One Legged Deadlift",
        "description": "This exercise involves holding a kettlebell in one hand and standing on one leg while bending forward to touch the kettlebell to the ground. It targets the hamstrings, glutes, and lower back while also improving balance and stability.",
        "muscles": "Glutes,Hips",
        "image": "kettlebell_exercises/Kettlebell_One_Legged_Deadlift.jpg"
    },
    {
        "name": "Kettlebell Overhead Carry",
        "description": "This exercise involves holding a kettlebell overhead and walking with it for a certain distance or time. It primarily targets the shoulders, core, and upper back muscles while also improving grip strength and stability.",
        "muscles": "Thighs",
        "image": "kettlebell_exercises/Kettlebell_Overhead_Carry.jpg"
    },
    {
        "name": "Kettlebell Overhead Triceps Extension",
        "description": "This exercise involves holding a kettlebell with both hands and extending it overhead while keeping the elbows close to the head. The movement primarily targets the triceps muscles in the arms.",
        "muscles": "Triceps,Upper Arms",
        "image": "kettlebell_exercises/Kettlebell_Overhead_Triceps_Extension.jpg"
    },
    {
        "name": "Kettlebell Pirate Ships",
        "description": "This exercise involves holding a kettlebell in one hand and swinging it between the legs while simultaneously lifting the opposite leg off the ground and extending it behind the body. The movement resembles a pirate ship rocking on the waves. The exercise targets the core, glutes, and hamstrings.",
        "muscles": "Rear Deltoid,Waist",
        "image": "kettlebell_exercises/Kettlebell_Pirate_Ships.jpg"
    },
    {
        "name": "Kettlebell Pistol Squat",
        "description": "This exercise involves holding a kettlebell in one hand while performing a pistol squat, which is a one-legged squat where the non-working leg is extended in front of the body. It targets the lower body, particularly the quads, glutes, and hamstrings, as well as the core for stability.",
        "muscles": "Glutes,Quadriceps,Thighs",
        "image": "kettlebell_exercises/Kettlebell_Pistol_Squat.jpg"
    },
    {
        "name": "Kettlebell Plyo Pushup",
        "description": "This exercise involves performing a pushup while holding onto kettlebells, and then explosively pushing up and jumping onto the kettlebells. It is a challenging plyometric exercise that targets the chest, shoulders, triceps, and core muscles.",
        "muscles": "Chest",
        "image": "kettlebell_exercises/Kettlebell_Plyo_Pushup.jpg"
    },
    {
        "name": "Kettlebell Press Up",
        "description": "This exercise involves performing a push-up while holding onto a kettlebell with one hand. The kettlebell adds an extra challenge to the exercise by requiring more stability and strength in the core and upper body. The exercise can be repeated on both sides for a balanced workout.",
        "muscles": "Chest",
        "image": "kettlebell_exercises/Kettlebell_Press_Up.jpg"
    },
    {
        "name": "Kettlebell Rear Lunge",
        "description": "This exercise involves holding a kettlebell and stepping back into a lunge position, then returning to a standing position. It primarily targets the glutes, hamstrings, and quadriceps.",
        "muscles": "Thighs",
        "image": "kettlebell_exercises/Kettlebell_Rear_Lunge.jpg"
    },
    {
        "name": "Kettlebell Romanian Deadlift",
        "description": "This exercise involves holding a kettlebell with both hands and hinging at the hips to lower the weight towards the ground while keeping the back straight. It primarily targets the hamstrings and glutes.",
        "muscles": "Hips",
        "image": "kettlebell_exercises/Kettlebell_Romanian_Deadlift.jpg"
    },
    {
        "name": "Kettlebell Russian Twist",
        "description": "This exercise involves sitting on the floor with your legs bent and feet flat on the ground, holding a kettlebell with both hands. You then twist your torso to one side, bringing the kettlebell to touch the ground beside you, before twisting to the other side and repeating the movement. This exercise targets the obliques and core muscles.",
        "muscles": "Waist",
        "image": "kettlebell_exercises/Kettlebell_Russian_Twist.jpg"
    },
    {
        "name": "Kettlebell Seated Press",
        "description": "This exercise involves sitting on a bench or chair and pressing a kettlebell overhead with one arm at a time. It primarily targets the shoulders and triceps while also engaging the core for stability.",
        "muscles": "Front Deltoid,Shoulders",
        "image": "kettlebell_exercises/Kettlebell_Seated_Press.jpg"
    },
    {
        "name": "Kettlebell Seesaw Press",
        "description": "The Kettlebell Seesaw Press is an exercise that involves pressing two kettlebells alternately while standing. It targets the shoulders, triceps, and core muscles, and can help improve upper body strength and stability.",
        "muscles": "Front Deltoid,Shoulders",
        "image": "kettlebell_exercises/Kettlebell_Seesaw_Press.jpg"
    },
    {
        "name": "Kettlebell Side Lunge",
        "description": "This exercise involves holding a kettlebell in one hand while lunging to the side with the opposite leg. It targets the legs, glutes, and core muscles.",
        "muscles": "Thighs",
        "image": "kettlebell_exercises/Kettlebell_Side_Lunge.jpg"
    },
    {
        "name": "Kettlebell Side Plank",
        "description": "This exercise involves holding a side plank position while also holding a kettlebell in one hand. The weight of the kettlebell adds an extra challenge to the exercise, requiring increased core stability and strength.",
        "muscles": "Waist",
        "image": "kettlebell_exercises/Kettlebell_Side_Plank.jpg"
    },
    {
        "name": "Kettlebell Single Arm Clean",
        "description": "This exercise involves using a kettlebell to perform a single-arm clean, which involves lifting the kettlebell from the ground to the shoulder in one fluid motion. It is a full-body exercise that primarily targets the shoulders, back, and legs.",
        "muscles": "Weightlifting",
        "image": "kettlebell_exercises/Kettlebell_Single_Arm_Clean.jpg"
    },
    {
        "name": "Kettlebell Single Arm Clean and Press",
        "description": "This exercise involves using a kettlebell to perform a single-arm clean and press movement. The kettlebell is lifted from the ground to the shoulder, then pressed overhead with one arm while maintaining proper form and control. This exercise targets the shoulders, arms, and core muscles.",
        "muscles": "Weightlifting",
        "image": "kettlebell_exercises/Kettlebell_Single_Arm_Clean_and_Press.jpg"
    },
    {
        "name": "Kettlebell Single Arm Swing",
        "description": "This exercise involves swinging a kettlebell with one arm, using a hip hinge motion to generate power and momentum. It targets the posterior chain muscles, including the glutes, hamstrings, and lower back, while also engaging the core and shoulders.",
        "muscles": "Hips,Thighs",
        "image": "kettlebell_exercises/Kettlebell_Single_Arm_Swing.jpg"
    },
    {
        "name": "Kettlebell Single Arm Thruster",
        "description": "This exercise involves holding a kettlebell in one hand and performing a squat, followed by pressing the kettlebell overhead in one fluid motion. It is a full-body exercise that targets the legs, core, shoulders, and arms.",
        "muscles": "Shoulders,Thighs",
        "image": "kettlebell_exercises/Kettlebell_Single_Arm_Thruster.jpg"
    },
    {
        "name": "Kettlebell Single Leg Deadlift",
        "description": "This exercise involves using a kettlebell and performing a deadlift while balancing on one leg. It helps to improve balance, stability, and strength in the lower body.",
        "muscles": "Hips,Thighs",
        "image": "kettlebell_exercises/Kettlebell_Single_Leg_Deadlift.jpg"
    },
    {
        "name": "Kettlebell Sit Up",
        "description": "This exercise involves lying on your back with a kettlebell held above your chest, then sitting up while keeping the kettlebell stable and lowering back down to the starting position. It primarily targets the abdominal muscles and can also engage the arms and shoulders.",
        "muscles": "Abs,Waist",
        "image": "kettlebell_exercises/Kettlebell_Sit_Up.jpg"
    },
    {
        "name": "Kettlebell Slingshot",
        "description": "This exercise involves swinging a kettlebell around the body in a circular motion, passing it from one hand to the other behind the back. It targets the core, shoulders, and arms while also improving coordination and grip strength.",
        "muscles": "Front Deltoid,Rear Deltoid,Shoulders,Side Deltoid",
        "image": "kettlebell_exercises/Kettlebell_Slingshot.jpg"
    },
    {
        "name": "Kettlebell Snatch",
        "description": "This exercise involves lifting a kettlebell from the ground to overhead in one fluid motion, using a combination of hip drive and arm extension. It is a full-body exercise that targets the shoulders, back, legs, and core.",
        "muscles": "Weightlifting",
        "image": "kettlebell_exercises/Kettlebell_Snatch.jpg"
    },
    {
        "name": "Kettlebell Sots Press",
        "description": "The Kettlebell Sots Press is an exercise that involves holding a kettlebell in the front rack position and pressing it overhead while in a deep squat. This exercise helps to improve upper body and core strength, as well as mobility and stability in the hips and ankles.",
        "muscles": "Front Deltoid,Glutes,Hips,Quadriceps,Shoulders,Thighs",
        "image": "kettlebell_exercises/Kettlebell_Sots_Press.jpg"
    },
    {
        "name": "Kettlebell Split Snatch",
        "description": "This exercise involves using a kettlebell to perform a split snatch movement, which involves lifting the kettlebell from the ground to overhead while simultaneously splitting the legs into a lunge position. It is a full-body exercise that targets the legs, core, and shoulders.",
        "muscles": "Hips",
        "image": "kettlebell_exercises/Kettlebell_Split_Snatch.jpg"
    },
    {
        "name": "Kettlebell Split Squat",
        "description": "This exercise involves holding a kettlebell in one hand while performing a split squat, which targets the legs and glutes. The weight of the kettlebell adds an extra challenge to the exercise and helps to increase strength and stability.",
        "muscles": "Thighs",
        "image": "kettlebell_exercises/Kettlebell_Split_Squat.jpg"
    },
    {
        "name": "Kettlebell Straight Leg Deadlift",
        "description": "This exercise involves holding a kettlebell with both hands and bending forward at the hips while keeping the legs straight. The movement targets the hamstrings, glutes, and lower back muscles.",
        "muscles": "Glutes,Hips,Spine",
        "image": "kettlebell_exercises/Kettlebell_Straight_Leg_Deadlift.jpg"
    },
    {
        "name": "Kettlebell Strict Press",
        "description": "This exercise involves lifting a kettlebell from shoulder height to overhead using only the strength of the arms and shoulders, without any momentum from the legs or hips. It primarily targets the deltoids, triceps, and upper back muscles.",
        "muscles": "Front Deltoid,Shoulders",
        "image": "kettlebell_exercises/Kettlebell_Strict_Press.jpg"
    },
    {
        "name": "Kettlebell Suitcase Deadlift",
        "description": "This exercise involves lifting a kettlebell with one hand while keeping the other hand free and extended to the side, mimicking the action of carrying a suitcase. It primarily targets the muscles in the legs, back, and core.",
        "muscles": "Hips",
        "image": "kettlebell_exercises/Kettlebell_Suitcase_Deadlift.jpg"
    },
    {
        "name": "Kettlebell Sumo Deadlift",
        "description": "This exercise involves using a kettlebell to perform a sumo deadlift, which targets the muscles in the legs, glutes, and lower back. The sumo stance allows for a wider range of motion and can be modified for different fitness levels.",
        "muscles": "Hips",
        "image": "kettlebell_exercises/Kettlebell_Sumo_Deadlift.jpg"
    },
    {
        "name": "Kettlebell Sumo High Pull",
        "description": "This exercise involves using a kettlebell and performing a sumo stance while pulling the kettlebell up towards the chest. It targets the muscles in the legs, hips, and upper back.",
        "muscles": "Biceps,Calves,Forearms,Front Deltoid,Glutes,Hamstrings,Hips,Quadriceps,Side Deltoid",
        "image": "kettlebell_exercises/Kettlebell_Sumo_High_Pull.jpg"
    },
    {
        "name": "Kettlebell Sumo Squat",
        "description": "This exercise involves holding a kettlebell with both hands and standing with feet wider than shoulder-width apart in a sumo stance. From there, the individual performs a squat, keeping their back straight and pushing their hips back. The exercise targets the legs, glutes, and core muscles.",
        "muscles": "Hips",
        "image": "kettlebell_exercises/Kettlebell_Sumo_Squat.jpg"
    },
    {
        "name": "Kettlebell Swing",
        "description": "This exercise involves swinging a kettlebell between the legs and up to shoulder height, using the momentum generated by the hips and legs. It primarily targets the glutes, hamstrings, and lower back, while also engaging the core and shoulders.",
        "muscles": "Front Deltoid,Glutes,Hamstrings,Hips",
        "image": "kettlebell_exercises/Kettlebell_Swing.jpg"
    },
    {
        "name": "Kettlebell Thruster",
        "description": "This exercise involves holding a kettlebell at shoulder height, squatting down, and then using the momentum from standing up to press the kettlebell overhead. It is a full-body exercise that targets the legs, core, and shoulders.",
        "muscles": "Calves,Front Deltoid,Hamstrings,Quadriceps,Shoulders,Side Deltoid,Triceps",
        "image": "kettlebell_exercises/Kettlebell_Thruster.jpg"
    },
    {
        "name": "Kettlebell Two Arm Clean",
        "description": "This exercise involves lifting a kettlebell from the ground to the shoulders using both arms in a clean motion. It is a full-body exercise that targets the legs, hips, back, shoulders, and arms. It is commonly used in strength and conditioning programs to improve power and explosiveness.",
        "muscles": "Shoulders",
        "image": "kettlebell_exercises/Kettlebell_Two_Arm_Clean.jpg"
    },
    {
        "name": "Kettlebell Two Arm Military Press",
        "description": "This exercise involves holding a kettlebell in each hand and pressing them overhead while standing. It primarily targets the shoulders, triceps, and upper back muscles.",
        "muscles": "Front Deltoid,Shoulders",
        "image": "kettlebell_exercises/Kettlebell_Two_Arm_Military_Press.jpg"
    },
    {
        "name": "Kettlebell Two Arm Row",
        "description": "This exercise involves holding a kettlebell in both hands and pulling it towards your chest while keeping your back straight. It primarily targets the muscles in your back and arms.",
        "muscles": "Back,Latissimus Dorsi,Traps",
        "image": "kettlebell_exercises/Kettlebell_Two_Arm_Row.jpg"
    },
    {
        "name": "Kettlebell Upright Row",
        "description": "This exercise involves holding a kettlebell with both hands and lifting it up towards the chest, keeping the elbows high and close to the body. It primarily targets the shoulders and upper back muscles.",
        "muscles": "Shoulders,Side Deltoid",
        "image": "kettlebell_exercises/Kettlebell_Upright_Row.jpg"
    },
    {
        "name": "Kettlebell Windmill",
        "description": "The Kettlebell Windmill is a strength training exercise that targets the core, shoulders, and hips. It involves holding a kettlebell overhead with one arm while bending and rotating the torso to touch the opposite foot. The exercise requires stability and mobility in the shoulders and hips, making it a challenging movement for many people.",
        "muscles": "Obliques,Waist",
        "image": "kettlebell_exercises/Kettlebell_Windmill.jpg"
    },
    {
        "name": "Kettlebell Wrist Curl",
        "description": "The kettlebell wrist curl is an exercise that targets the forearm muscles. It involves holding a kettlebell with an overhand grip and curling the wrist upwards, then lowering it back down. This exercise can help improve grip strength and wrist mobility.",
        "muscles": "Forearms",
        "image": "kettlebell_exercises/Kettlebell_Wrist_Curl.jpg"
    },
    {
        "name": "Kipping Handstand Push-up",
        "description": "This exercise involves performing a handstand push-up while using a kipping motion to generate momentum and assist with the movement. It requires upper body strength, core stability, and coordination.",
        "muscles": "Shoulders",
        "image": "kettlebell_exercises/Kipping_Handstand_Push-up.jpg"
    },
    {
        "name": "Kipping Muscle Up",
        "description": "This exercise involves using a swinging motion to generate momentum and pull oneself up and over a set of rings or bar, transitioning from a hanging position to a support position. It requires a combination of upper body strength, coordination, and timing.",
        "muscles": "Abs,Latissimus Dorsi,Waist",
        "image": "kettlebell_exercises/Kipping_Muscle_Up.jpg"
    },
    {
        "name": "Knee Touch Crunch",
        "description": "This exercise involves lying on your back with your knees bent and feet flat on the ground. You then lift your shoulders off the ground and touch your right knee with your left elbow, then switch and touch your left knee with your right elbow. This movement targets the abs and obliques.",
        "muscles": "Abs,Waist",
        "image": "kettlebell_exercises/Knee_Touch_Crunch.jpg"
    },
    {
        "name": "Kneeling Hip Flexor",
        "description": "This exercise involves kneeling on one knee while keeping the other foot flat on the ground in front of you. You then lean forward, stretching the hip flexor muscles in the kneeling leg. This exercise can help improve flexibility and reduce tightness in the hip flexors.",
        "muscles": "Glutes,Quadriceps,Thighs",
        "image": "kettlebell_exercises/Kneeling_Hip_Flexor.jpg"
    },
    {
        "name": "Kneeling Hip Thrust",
        "description": "This exercise involves kneeling on the ground with your feet flat on the floor and your hands on your hips. From this position, you thrust your hips forward and upward, squeezing your glutes at the top of the movement. This exercise targets the glutes and can be done with or without added weight.",
        "muscles": "Hips",
        "image": "kettlebell_exercises/Kneeling_Hip_Thrust.jpg"
    },
    {
        "name": "Kneeling Plank",
        "description": "This exercise involves starting in a kneeling position and then extending the legs behind you to hold a plank position. It is a great core and upper body strengthening exercise.",
        "muscles": "Waist",
        "image": "kettlebell_exercises/Kneeling_Plank.jpg"
    },
    {
        "name": "Kneeling Push-up",
        "description": "This exercise involves starting in a kneeling position and performing a push-up by lowering your body towards the ground and then pushing back up. It is a modified version of a traditional push-up that is easier on the wrists and shoulders.",
        "muscles": "Chest",
        "image": "kettlebell_exercises/Kneeling_Push-up.jpg"
    },
    {
        "name": "Kneeling Shoulder Tap",
        "description": "This exercise involves starting in a kneeling position and tapping your opposite shoulder with your hand while maintaining a stable core and avoiding any twisting or swaying movements. It helps to improve shoulder stability and core strength.",
        "muscles": "Chest",
        "image": "kettlebell_exercises/Kneeling_Shoulder_Tap.jpg"
    },
    {
        "name": "Knuckle Push-up",
        "description": "This exercise involves performing a push-up while balancing on the knuckles of the hands instead of the palms. It can help to strengthen the wrists and forearms, as well as the chest, shoulders, and triceps.",
        "muscles": "Chest",
        "image": "kettlebell_exercises/Knuckle_Push-up.jpg"
    },
    {
        "name": "Korean Dips",
        "description": "A description or demonstration of the exercise known as Korean dips, which typically involves using parallel bars to perform a dip motion while simultaneously lifting one leg off the ground and extending it forward. This exercise targets the triceps, chest, and core muscles.",
        "muscles": "Chest",
        "image": "kettlebell_exercises/Korean_Dips.jpg"
    }
]